erpdev.СХК_Расширение/src/DataProcessors/СХК_СоздатьСерии/СХК_СоздатьСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_СоздатьСерии</name>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СерииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоденДо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb25b6bc-7f7a-447b-8658-e8893ac87128">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="43c7d80b-bd8e-4151-b0e1-084444292845">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СХК_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СХК_Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="448beea5-fe0e-4558-b386-88fdde891a35">
    <name>ПроизводительВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="811ed59d-1e61-4b9f-b4fb-3b5dc1e65b8c">
    <name>RFIDUser</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf11029-162c-49c8-b54b-767bda8ca180">
    <name>СерияНоменклатурыДляЦенообразования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80a89a7f-1fed-4811-b40c-3a5ab50662a9">
    <name>RFIDTID</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0c1efe6-bb2e-4ed3-80a8-cab3c7e1b456">
    <name>RFIDEPC</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6dd6eb6e-b1b8-4da9-9b97-35f41594d1d6">
    <name>EPCGTIN</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50ccfd5f-e7cd-4e00-a6ee-2b31c3198df5">
    <name>RFIDМеткаНеЧитаемая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ebda52-1b95-4474-a953-08ea8d771161">
    <name>НомерКиЗГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b41bc339-8059-4e1b-a18e-9b2d19e4c2e1">
    <name>ПроизводительЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0031dd3e-8675-47e2-ae98-c7e7a9b2060a">
    <name>ИдентификаторПартииВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f266e93e-196b-4c32-867c-1eb7dcc148b4">
    <name>Справка2ЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="888c0446-d41f-43e2-9d71-c2abeb77ef11">
    <name>ЗаписьСкладскогоЖурналаВЕТИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff2d5643-26e8-40ec-b266-8fb17cd78983">
    <name>МаксимальнаяРозничнаяЦенаМОТП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_СоздатьСерии/Forms/ФормаСерии/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Параметры.ЗначенияЗаполнения;
	
	Если СтруктураПараметров.Количество() >=1 Тогда  
		ЭтаФорма.ВидНоменклатуры  = СтруктураПараметров.ВидНоменклатуры;
		ЭтаФорма.СерияНоменклатуры  = СтруктураПараметров.Ссылка;
		ЭтаФорма.Номенклатура  = СтруктураПараметров.Номенклатура;
		ЗаполнитьПоля(СтруктураПараметров);
	КонецЕсли;   
	

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоля(СтруктураПараметров) 
	Если СерияНоменклатуры.Пустая() = Истина Тогда
		ЭтотОбъект.ДатаПроизводства = ТекущаяДата();
		ЭтотОбъект.ГоденДо = ДобавитьМесяц(ТекущаяДата(),Номенклатура.СрокГодности);  
		ЭтаФорма.СХК_СрокГодности = Номенклатура.СрокГодности;
		ВидимостьПрефикс();
		СформироватьПолучитьНомер();	
		
	Иначе 
		ЭтаФорма.ДатаПроизводства = ЭтаФорма.СерияНоменклатуры.ДатаПроизводства;	
		ЭтаФорма.ГоденДо = ЭтаФорма.СерияНоменклатуры.ГоденДо;	
		ЭтаФорма.Упаковка = ЭтаФорма.СерияНоменклатуры.СХК_Упаковка;
		ЭтаФорма.Номер = ЭтаФорма.СерияНоменклатуры.Номер;
		Если ЭтаФорма.СерияНоменклатуры.СХК_СрокГодности <> 0 Тогда 
			ЭтаФорма.СХК_СрокГодности = ЭтаФорма.СерияНоменклатуры.СХК_СрокГодности;
		Иначе
			ЭтаФорма.СХК_СрокГодности = Номенклатура.СрокГодности;
		КонецЕсли;  
		
		ЭтаФорма.Элементы.ГруппаЭлемента.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Сохранить.Доступность = Ложь;
		
	КонецЕсли;

	ЗаполнитьУпаковки();
	
КонецПроцедуры 


&НаСервере
Процедура ВидимостьПрефикс()
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","СХК_ИспользоватьЛицензию");
	Значение=УправлениеСвойствами.ЗначениеСвойства(ЭтаФорма.Номенклатура,ДопСвойство);
	Если Значение = Истина Тогда
		ЭтаФорма.Элементы.ГруппаПрефикс.Видимость = Истина;  
	Иначе
		ЭтаФорма.Элементы.ГруппаПрефикс.Видимость = Ложь;  
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУпаковки()
		ЗапросУп = Новый Запрос;
		ЗапросУп.Текст = "ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = &ПометкаУдаления
		|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец"; 
		ЗапросУп.УстановитьПараметр("ПометкаУдаления",Ложь);
		ЗапросУп.УстановитьПараметр("Владелец",Номенклатура);
		РезультатЗапросаУп = ЗапросУп.Выполнить();
				
		СписокУпаковок = Новый СписокЗначений; 
		СписокУпаковок.Очистить();
		СписокУпаковок.ЗагрузитьЗначения(РезультатЗапросаУп.Выгрузить().ВыгрузитьКолонку("Ссылка"));		
		ЭтаФорма.Элементы.ВыборУпаковки.СписокВыбора.ЗагрузитьЗначения(СписокУпаковок.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПолучитьНомер() 
	
	Если Не Упаковка.Пустая() Тогда
		Уп = "по " +Строка(Упаковка.Числитель) + "";
	Иначе
		Уп = "";
	КонецЕсли;
	
	Преф  = ?(ЗначениеЗаполнено(ЭтаФорма.Префикс),"("+Строка(ЭтаФорма.Префикс)+")" , "");
	ЭтотОбъект.Номер = Преф +Строка(Номенклатура.Артикул) + " от " + 
					   Строка(Формат(ЭтотОбъект.ДатаПроизводства,"ДФ=dd.MM.yy"))+ " (" + 
					   Строка(Уп)+ " шт) до " + Строка(Формат(ЭтотОбъект.ГоденДо,"ДФ=dd.MM.yy"));
КонецПроцедуры

&НаКлиенте
Процедура ВыборУпаковкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	СЗУпаковкиПриИзмененииНаСервере(ВыбранноеЗначение);

КонецПроцедуры


&НаСервере
Процедура СЗУпаковкиПриИзмененииНаСервере(Эл)  
	ЭтаФорма.Упаковка = Эл;  
	СформироватьПолучитьНомер();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроизводстваПриИзменении(Элемент)
	ДатаПроизводстваПриИзмененииНаСервере();
	СформироватьПолучитьНомер();
КонецПроцедуры

&НаСервере
Процедура ДатаПроизводстваПриИзмененииНаСервере()  
	ЭтотОбъект.ГоденДо = ДобавитьМесяц(ЭтотОбъект.ДатаПроизводства,Номенклатура.СрокГодности);
КонецПроцедуры


&НаКлиенте
Процедура ГоденДоПриИзменении(Элемент) 
	//ГоденДоПриИзмененииНаСервере();
	СформироватьПолучитьНомер();
КонецПроцедуры


&НаСервере
Функция СохранитьНаСервере()
	Если ЭтотОбъект.ДатаПроизводства = Дата(1,1,1) ИЛИ
		ЭтотОбъект.ГоденДо = Дата(1,1,1) ИЛИ
		ЭтотОбъект.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
		ош = "Заполните все поля"; 
		
		Возврат ош;

	КонецЕсли;		
	
	спр = Справочники.СерииНоменклатуры.НайтиПоРеквизиту("Номер",ЭтаФорма.Номер);
	
	Если СерияНоменклатуры.Пустая() = Истина Тогда 
		Если спр.Пустая() = Истина Тогда
			спр = Справочники.СерииНоменклатуры.СоздатьЭлемент();
		Иначе
			спр = спр.Ссылка.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		спр = СерияНоменклатуры.ПолучитьОбъект();
	КонецЕсли;   
	
	спр.ДатаПроизводства = ЭтаФорма.ДатаПроизводства;
	спр.ГоденДо = ЭтаФорма.ГоденДо;
	спр.СХК_Упаковка = ЭтаФорма.Упаковка;   
	спр.ВидНоменклатуры = ЭтаФорма.ВидНоменклатуры;
	спр.Наименование =  ЭтаФорма.Номер;
	спр.Номер =  ЭтаФорма.Номер;   
	спр.СХК_СрокГодности =  ЭтаФорма.СХК_СрокГодности;   
	спр.СХК_Префикс =  ЭтаФорма.Префикс;   
	
	Попытка
		спр.Записать(); 
		ЭтаФорма.СерияНоменклатуры = спр.Ссылка;
		ош =  Истина;
	Исключение
		ош =  Ложь;
	КонецПопытки; 
	
	Возврат ош;
		
КонецФункции


&НаКлиенте
Процедура Сохранить(Команда) 
	Ош = СохранитьНаСервере();
	Если ош = Истина Тогда
		ЭтаФорма.Закрыть();  
	Иначе

		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения() Экспорт
	ЭтаФорма.Закрыть();	
КонецПроцедуры



&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	СписокПараметров = Новый Структура;  
    СписокПараметров.Вставить("Номер", ЭтаФорма.СерияНоменклатуры);  
    ОповеститьОВыборе(СписокПараметров);    

КонецПроцедуры

&НаСервере
Процедура СХК_СрокГодностиПриИзмененииНаСервере()
	ЭтотОбъект.ГоденДо = ДобавитьМесяц(ЭтотОбъект.ДатаПроизводства,ЭтотОбъект.СХК_СрокГодности);
КонецПроцедуры

&НаКлиенте
Процедура СХК_СрокГодностиПриИзменении(Элемент)
	СХК_СрокГодностиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрефиксПриИзменении(Элемент)
	Если ИспользоватьПрефикс = Истина Тогда
		ЭтаФорма.Элементы.Префикс.Видимость = Истина;
		ЗаполнитьПрефиксы();
	Иначе
		ЭтаФорма.Элементы.Префикс.Видимость = Ложь; 
		ОчиститьПрефиксы();
	КонецЕсли;		
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьПрефиксы()
	ЭтаФорма.Префикс = "СМФ";	
	СформироватьПолучитьНомер();
КонецПроцедуры  

&НаСервере
Процедура ОчиститьПрефиксы()
	ЭтаФорма.Префикс = "";	    
	СформироватьПолучитьНомер();
КонецПроцедуры
